-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-04-13 17:40:17
-- 伺服器版本： 10.4.28-MariaDB
-- PHP 版本： 8.0.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `pokemon`
--

-- --------------------------------------------------------

--
-- 資料表結構 `allpokemon`
--

CREATE TABLE `allpokemon` (
  `id` int(11) NOT NULL,
  `name` varchar(10) NOT NULL,
  `star` int(11) NOT NULL,
  `color` varchar(2) NOT NULL,
  `card1` int(11) NOT NULL,
  `card2` int(11) NOT NULL,
  `card3` int(11) NOT NULL,
  `card4` int(11) NOT NULL,
  `card5` int(11) NOT NULL,
  `card6` int(11) NOT NULL,
  `card7` int(11) NOT NULL,
  `card8` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `allpokemon`
--

INSERT INTO `allpokemon` (`id`, `name`, `star`, `color`, `card1`, `card2`, `card3`, `card4`, `card5`, `card6`, `card7`, `card8`) VALUES
(1, 's3凱路迪歐', 3, '白', 0, 1, 0, 38, 0, 15, 32, 0),
(2, 's3卡比獸', 3, '白', 0, 14, 0, 4, 2, 6, 0, 0),
(3, 's3呆呆王', 3, '白', 0, 45, 0, 3, 0, 0, 33, 38),
(4, 's3太陽岩', 3, '白', 0, 0, 20, 0, 0, 0, 30, 21),
(5, 's3巨金怪', 3, '白', 0, 39, 13, 0, 22, 21, 0, 0),
(6, 's3月石', 3, '白', 0, 6, 0, 25, 7, 0, 0, 20),
(7, 's3沙奈朵', 3, '白', 0, 10, 0, 50, 17, 0, 0, 40),
(8, 's3洛托姆', 3, '白', 0, 0, 44, 0, 6, 20, 34, 0),
(9, 's3烈焰馬', 3, '白', 45, 0, 0, 0, 0, 39, 7, 0),
(10, 's3烏鴉頭頭', 3, '白', 41, 0, 0, 0, 33, 12, 0, 6),
(11, 's3皮卡丘', 3, '白', 0, 0, 36, 31, 19, 43, 37, 15),
(12, 's3破破舵輪', 3, '白', 0, 0, 38, 0, 0, 29, 43, 30),
(13, 's3穿著熊', 3, '白', 6, 25, 0, 44, 0, 36, 0, 0),
(14, 's3路卡利歐', 3, '白', 22, 0, 30, 0, 45, 0, 14, 0),
(15, 's3阿羅拉九尾', 3, '白', 11, 17, 39, 5, 0, 0, 0, 0),
(16, 's3雙彈瓦斯', 3, '白', 14, 0, 0, 0, 49, 0, 0, 7),
(17, 's3音波龍', 3, '白', 0, 0, 42, 10, 0, 0, 27, 14),
(18, 's4代拉基翁', 4, '白', 0, 12, 0, 21, 48, 0, 0, 0),
(19, 's4凱路迪歐', 4, '白', 0, 34, 0, 8, 0, 23, 36, 0),
(20, 's4勾帕路翁', 4, '白', 0, 0, 28, 49, 0, 0, 0, 13),
(21, 's4卡比獸', 4, '白', 47, 0, 0, 34, 0, 32, 41, 0),
(22, 's4呆呆王', 4, '白', 18, 0, 0, 0, 0, 26, 20, 0),
(23, 's4土地雲', 4, '白', 0, 21, 0, 0, 0, 0, 38, 49),
(24, 's4太陽岩', 4, '白', 40, 16, 0, 0, 0, 0, 47, 0),
(25, 's4巨金怪', 4, '白', 0, 23, 46, 39, 0, 0, 0, 0),
(26, 's4月石', 4, '白', 19, 0, 0, 0, 0, 0, 24, 0),
(27, 's4沙奈朵', 4, '白', 0, 0, 21, 0, 35, 0, 0, 12),
(28, 's4畢力吉翁', 4, '白', 15, 0, 4, 0, 5, 0, 0, 0),
(29, 's4路卡利歐', 4, '白', 0, 0, 24, 0, 37, 13, 0, 0),
(30, 's4雷電雲', 4, '白', 0, 0, 0, 22, 0, 37, 0, 1),
(31, 's4音波龍', 4, '白', 3, 44, 0, 0, 11, 0, 0, 0),
(32, 's4龍捲雲', 4, '白', 0, 0, 0, 0, 12, 0, 0, 3),
(33, '伊裴爾塔爾', 5, '紫', 0, 0, 0, 0, 0, 0, 0, 17),
(34, '水君', 5, '紫', 7, 0, 0, 0, 0, 0, 0, 0),
(35, '澤爾尼亞斯W', 5, '紫', 0, 0, 0, 0, 0, 0, 31, 0),
(36, '炎帝W', 5, '紫', 0, 22, 0, 0, 0, 0, 0, 0),
(37, '金-s4噴火龍', 4, '金', 31, 0, 0, 0, 0, 0, 0, 0),
(38, '金-s4妙蛙花', 4, '金', 35, 46, 0, 0, 0, 1, 0, 23),
(39, '金-s4水箭龜', 4, '金', 0, 50, 0, 0, 14, 0, 3, 0),
(40, '金-s4瑪納霏', 4, '金', 43, 0, 22, 0, 9, 0, 0, 4),
(41, '金-s4美洛耶塔', 4, '金', 0, 29, 0, 0, 0, 46, 0, 0),
(42, '金-代歐奇西斯', 5, '金', 0, 11, 0, 0, 18, 0, 0, 0),
(43, '金-夢幻Z', 5, '金', 32, 0, 0, 30, 0, 0, 0, 0),
(44, '金-拂曉之翼Z', 5, '金', 0, 0, 0, 0, 0, 0, 22, 0),
(45, '金-蒂安希', 5, '金', 0, 0, 0, 0, 0, 42, 8, 0),
(46, '金-超夢X', 5, '金', 0, 0, 0, 11, 0, 0, 0, 0),
(47, '金-雷吉奇卡斯', 5, '金', 0, 0, 0, 0, 0, 9, 0, 2),
(48, '金-黃昏之鬃z', 5, '金', 0, 37, 0, 0, 0, 0, 0, 48),
(49, '銀伴戰獸W', 5, '紫', 0, 0, 0, 0, 0, 18, 0, 0),
(50, '阿爾宙斯(一般)', 5, '紫', 0, 0, 0, 0, 43, 0, 0, 0),
(51, '阿爾宙斯(水)', 5, '紫', 0, 0, 0, 0, 30, 0, 0, 0),
(52, '阿爾宙斯(火)', 5, '紫', 0, 0, 27, 0, 0, 0, 0, 0),
(53, '阿爾宙斯(草)', 5, '紫', 0, 0, 0, 42, 0, 0, 0, 0),
(54, '雷公W', 5, '紫', 0, 0, 2, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- 資料表結構 `card`
--

CREATE TABLE `card` (
  `id` int(11) NOT NULL,
  `card1` varchar(20) NOT NULL,
  `card2` varchar(20) NOT NULL,
  `card3` varchar(20) NOT NULL,
  `card4` varchar(20) NOT NULL,
  `card5` varchar(20) NOT NULL,
  `card6` varchar(20) NOT NULL,
  `card7` varchar(20) NOT NULL,
  `card8` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- 傾印資料表的資料 `card`
--

INSERT INTO `card` (`id`, `card1`, `card2`, `card3`, `card4`, `card5`, `card6`, `card7`, `card8`) VALUES
(1, 's1利歐路', 's3凱路迪歐', 's1小卡比獸', 's1呆呆獸', 's1利歐路', '金-s4妙蛙花', 's2穿著熊', 's4雷電雲'),
(2, 's2路卡利歐', 's1拉魯拉絲', '雷公W', 's2烈焰馬', 's3卡比獸', 's1拉魯拉絲', 's4噴火龍', '金-雷吉奇卡斯'),
(3, 's4音波龍', 's2穿著熊', 's2穿著熊', 's3呆呆王', 's1黑暗鴉', 's2烏鴉頭頭', '金-s4水箭龜', 's4龍捲雲'),
(4, 's1鐵啞鈴', 's1洛托姆', 's4畢力吉翁', 's3卡比獸', 's2阿羅拉九尾', 's1洛托姆', 's1利歐路', '金-s4瑪納霏'),
(5, 's2阿羅拉九尾', 's2嗡蝠', 's1呆呆獸', 's3阿羅拉九尾', 's4畢力吉翁', 's1黑暗鴉', 's1小火馬', 's4畢力吉翁'),
(6, 's3穿著熊', 's3月石', 's1童偶熊', 's1小卡比獸', 's3洛托姆', 's3卡比獸', 's1童偶熊', 's3烏鴉頭頭'),
(7, '水君', 's1呆呆獸', 's2奇魯莉安', 's4噴火龍', 's3月石', 's2洛托姆', 's3烈焰馬', 's3雙彈瓦斯'),
(8, 's1小火馬', 's1阿羅拉六尾', 's2奇魯莉安', 's4凱路迪歐', 's2洛托姆', 's1呆呆獸', '金-蒂安希', 's1拉魯拉絲'),
(9, 's1阿羅拉六尾', 's2金屬怪', 's4水箭龜', 's2奇魯莉安', '金-s4瑪納霏', '金-雷吉奇卡斯', 's1嗡蝠', 's2瓦斯彈'),
(10, 's2小卡比獸', 's3沙奈朵', 's2烈焰馬', 's3音波龍', 's2烈焰馬', 's2洛托姆', 's2烈焰馬', 's1利歐路'),
(11, 's3阿羅拉九尾', '金-代歐奇西斯', 's4噴火龍', '金-超夢X', 's4音波龍', 's2奇魯莉安', 's1阿羅拉六尾', 's1童偶熊'),
(12, 's2瓦斯彈', 's4代拉基翁', 's4代拉基翁', 's1童偶熊', 's4龍捲雲', 's3烏鴉頭頭', 's1鐵啞鈴', 's4沙奈朵'),
(13, 's2呆殼獸', 's1童偶熊', 's3巨金怪', 's2路卡利歐', 's4美洛耶塔', 's4路卡利歐', 's2嗡蝠', 's4勾帕路翁'),
(14, 's3雙彈瓦斯', 's3卡比獸', 's1呆呆獸', 's1利歐路', '金-s4水箭龜', 's1呆呆獸', 's3路卡利歐', 's3音波龍'),
(15, 's4畢力吉翁', 's1鐵啞鈴', 's2阿羅拉九尾', 's2洛托姆', 's1童偶熊', 's3凱路迪歐', 's1小卡比獸', 's3皮卡丘'),
(16, 's1嗡蝠', 's4太陽岩', 's1阿羅拉六尾', 's2洛托姆', 's1嗡蝠', 's2瓦斯彈', 's1呆呆獸', 's2奇魯莉安'),
(17, 's2穿著熊', 's3阿羅拉九尾', 's2金屬怪', 's1嗡蝠', 's3沙奈朵', 's2金屬怪', 's2路卡利歐', '伊裴爾塔爾'),
(18, 's4呆呆王', 's2嗡蝠', 's2嗡蝠', 's4美洛耶塔', '金-代歐奇西斯', '銀伴戰獸W', 's2路卡利歐', 's1嗡蝠'),
(19, 's4月石', 's1鐵啞鈴', 's1利歐路', 's1拉魯拉絲', 's3皮卡丘', 's1鐵啞鈴', 's1洛托姆', 's2洛托姆'),
(20, 's2嗡蝠', 's2瓦斯彈', 's3太陽岩', 's1利歐路', 's1洛托姆', 's3洛托姆', 's4呆呆王', 's3月石'),
(21, 's2金屬怪', 's4土地雲', 's4沙奈朵', 's4代拉基翁', 's1鐵啞鈴', 's3巨金怪', 's1拉魯拉絲', 's3太陽岩'),
(22, 's3路卡利歐', '炎帝W', '金-s4瑪納霏', 's4雷電雲', 's3巨金怪', 's2烈焰馬', '金-拂曉之翼Z', 's1利歐路'),
(23, 's2奇魯莉安', 's4巨金怪', 's1嗡蝠', 's2奇魯莉安', 's2路卡利歐', 's4凱路迪歐', 's2烈焰馬', '金-s4妙蛙花'),
(24, 's1拉魯拉絲', 's2阿羅拉九尾', 's4路卡利歐', 's2嗡蝠', 's2呆殼獸', 's1童偶熊', 's4月石', 's2烈焰馬'),
(25, 's1阿羅拉六尾', 's3穿著熊', 's1小火馬', 's3月石', 's1鐵啞鈴', 's1小火馬', 's2金屬怪', 's2阿羅拉九尾'),
(26, 's3雙彈瓦斯', 's2路卡利歐', 's1嗡蝠', 's2阿羅拉九尾', 's1小火馬', 's4呆呆王', 's2洛托姆', 's1童偶熊'),
(27, 's2金屬怪', 's2阿羅拉九尾', '阿爾宙斯(火)', 's2呆殼獸', 's2阿羅拉九尾', 's2小卡比獸', 's3音波龍', 's2烈焰馬'),
(28, 's2烈焰馬', 's2小卡比獸', 's4勾帕路翁', 's1鐵啞鈴', 's2呆殼獸', 's1呆呆獸', 's4月石', 's2呆殼獸'),
(29, 's2奇魯莉安', '金-s4美洛耶塔', 's2呆殼獸', 's1阿羅拉六尾', 's1小卡比獸', 's3破破舵輪', 's2烏鴉頭頭', 's2穿著熊'),
(30, 's2洛托姆', 's2洛托姆', 's3路卡利歐', '金-夢幻Z', '阿爾宙斯(水)', 's2嗡蝠', 's3太陽岩', 's3破破舵輪'),
(31, '金-s4噴火龍', 's1童偶熊', 's2嗡蝠', 's3皮卡丘', 's2嗡蝠', 's2阿羅拉九尾', '澤爾尼亞斯W', 's2金屬怪'),
(32, '金-夢幻Z', 's2烏鴉頭頭', 's1黑暗鴉', 's2金屬怪', 's2瓦斯彈', 's4卡比獸', 's3凱路迪歐', 's2路卡利歐'),
(33, 's2阿羅拉九尾', 's1利歐路', 's1洛托姆', 's1小火馬', 's3烏鴉頭頭', 's2呆殼獸', 's3呆呆王', 's1小火馬'),
(34, 's2烏鴉頭頭', 's4凱路迪歐', 's2瓦斯彈', 's4卡比獸', 's2小卡比獸', 's1阿羅拉六尾', 's3洛托姆', 's2小卡比獸'),
(35, '金-s4妙蛙花', 's2瓦斯彈', 's2路卡利歐', 's1黑暗鴉', 's4沙奈朵', 's1利歐路', 's1黑暗鴉', 's2烏鴉頭頭'),
(36, 's2小卡比獸', 's1小火馬', 's3皮卡丘', 's1嗡蝠', 's1拉魯拉絲', 's3穿著熊', 's4凱路迪歐', 's1小卡比獸'),
(37, '拂曉之翼z', '金-黃昏之鬃z', 's1小卡比獸', 's1洛托姆', 's4路卡利歐', 's4雷電雲', 's3皮卡丘', 's1阿羅拉六尾'),
(38, 's1黑暗鴉', 's2呆殼獸', 's3破破舵輪', 's3凱路迪歐', 's1阿羅拉六尾', 's2路卡利歐', 's4土地雲', 's3呆呆王'),
(39, 's1呆呆獸', 's3巨金怪', 's3阿羅拉九尾', 's4巨金怪', 's2金屬怪', 's3烈焰馬', 's2小卡比獸', 's1黑暗鴉'),
(40, 's4太陽岩', 's2奇魯莉安', 's2小卡比獸', 's2小卡比獸', 's2烏鴉頭頭', 's2穿著熊', 's2奇魯莉安', 's3沙奈朵'),
(41, 's3烏鴉頭頭', 's2烈焰馬', 's2洛托姆', 's2烏鴉頭頭', 's1拉魯拉絲', 's1阿羅拉六尾', 's4卡比獸', 's2烏鴉頭頭'),
(42, 's1小卡比獸', 's1黑暗鴉', 's3音波龍', '阿爾宙斯(草)', 's1呆呆獸', '金-蒂安希', 's1黑暗鴉', 's2穿著熊'),
(43, '金-s4瑪納霏', 's2穿著熊', 's2小卡比獸', 's1小火馬', '阿爾宙斯(一般)', 's3皮卡丘', 's3破破舵輪', 's2路卡利歐'),
(44, 's4太陽岩', 's4音波龍', 's3洛托姆', 's3穿著熊', 's2呆殼獸', 's2小卡比獸', 's1黑暗鴉', 's1洛托姆'),
(45, 's3烈焰馬', 's3呆呆王', 's3烈焰馬', 's2穿著熊', 's3路卡利歐', 's2路卡利歐', 's2小卡比獸', 's1鐵啞鈴'),
(46, 's1小卡比獸', '金-s4妙蛙花', 's4巨金怪', 's2金屬怪', 's1小火馬', '金-s4美洛耶塔', 's2呆殼獸', 's1呆呆獸'),
(47, 's4卡比獸', 's1洛托姆', '金-超夢', 's2穿著熊', 's2穿著熊', 's2瓦斯彈', 's4太陽岩', 's4龍捲雲'),
(48, 's1童偶熊', 's1小卡比獸', 's1鐵啞鈴', 's2瓦斯彈', 's4代拉基翁', 's1嗡蝠', 's2烏鴉頭頭', '金-黃昏之鬃z'),
(49, 's1拉魯拉絲', 's1嗡蝠', 's1拉魯拉絲', 's4勾帕路翁', 's3雙彈瓦斯', 's4勾帕路翁', 's2阿羅拉九尾', 's4土地雲'),
(50, 's1洛托姆', '金-s4水箭龜', 's2烏鴉頭頭', 's3沙奈朵', 's2奇魯莉安', 's2呆殼獸', 's2瓦斯彈', 's2嗡蝠');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `allpokemon`
--
ALTER TABLE `allpokemon`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `card`
--
ALTER TABLE `card`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `allpokemon`
--
ALTER TABLE `allpokemon`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=55;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `card`
--
ALTER TABLE `card`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
